export const airports = [
  // مصر
  { value: 'HMB', label: 'مطار سوهاج الدولي (HMB) - سوهاج، مصر' },
  { value: 'CAI', label: 'مطار القاهرة الدولي (CAI) - القاهرة، مصر' },
  { value: 'HBE', label: 'مطار برج العرب الدولي (HBE) - الإسكندرية، مصر' },
  { value: 'LXR', label: 'مطار الأقصر الدولي (LXR) - الأقصر، مصر' },
  { value: 'ASW', label: 'مطار أسوان الدولي (ASW) - أسوان، مصر' },
  { value: 'HRG', label: 'مطار الغردقة الدولي (HRG) - الغردقة، مصر' },
  { value: 'SSH', label: 'مطار شرم الشيخ الدولي (SSH) - شرم الشيخ، مصر' },
  { value: 'ALY', label: 'مطار الإسكندرية الدولي (ALY) - الإسكندرية، مصر' },
  { value: 'ATZ', label: 'مطار أسيوط الدولي (ATZ) - أسيوط، مصر' },

  // السعودية
  { value: 'JED', label: 'مطار الملك عبدالعزيز الدولي (JED) - جدة، السعودية' },
  { value: 'RUH', label: 'مطار الملك خالد الدولي (RUH) - الرياض، السعودية' },
  { value: 'DMM', label: 'مطار الملك فهد الدولي (DMM) - الدمام، السعودية' },
  { value: 'MED', label: 'مطار الأمير محمد بن عبدالعزيز (MED) - المدينة المنورة، السعودية' },
  { value: 'AHB', label: 'مطار أبها الإقليمي (AHB) - أبها، السعودية' },
  { value: 'TUU', label: 'مطار تبوك الإقليمي (TUU) - تبوك، السعودية' },

  // الإمارات
  { value: 'DXB', label: 'مطار دبي الدولي (DXB) - دبي، الإمارات' },
  { value: 'SHJ', label: 'مطار الشارقة الدولي (SHJ) - الشارقة، الإمارات' },
  { value: 'AUH', label: 'مطار أبوظبي الدولي (AUH) - أبوظبي، الإمارات' },

  // الكويت
  { value: 'KWI', label: 'مطار الكويت الدولي (KWI) - مدينة الكويت، الكويت' },

  // قطر
  { value: 'DOH', label: 'مطار حمد الدولي (DOH) - الدوحة، قطر' },

  // البحرين
  { value: 'BAH', label: 'مطار البحرين الدولي (BAH) - المنامة، البحرين' },

  // الأردن
  { value: 'AMM', label: 'مطار الملكة علياء الدولي (AMM) - عمان، الأردن' },
  { value: 'AQJ', label: 'مطار الملك حسين الدولي (AQJ) - العقبة، الأردن' },

  // عمان
  { value: 'MCT', label: 'مطار مسقط الدولي (MCT) - مسقط، عمان' },

  // تركيا
  { value: 'IST', label: 'مطار إسطنبول (IST) - إسطنبول، تركيا' },
  { value: 'SAW', label: 'مطار صبيحة كوكجن الدولي (SAW) - إسطنبول، تركيا' },

  // وجهات عالمية
  { value: 'JFK', label: 'مطار جون إف كينيدي (JFK) - نيويورك، أمريكا' },
  { value: 'LHR', label: 'مطار هيثرو (LHR) - لندن، بريطانيا' },
  { value: 'CDG', label: 'مطار شارل ديغول (CDG) - باريس، فرنسا' },
  { value: 'FRA', label: 'مطار فرانكفورت (FRA) - فرانكفورت، ألمانيا' },
  { value: 'BKK', label: 'مطار سوفارنابومي (BKK) - بانكوك، تايلاند' },
  { value: 'KUL', label: 'مطار كوالالمبور الدولي (KUL) - كوالالمبور، ماليزيا' }
];
